TITLE Tymoshenko_L_1

IDEAL					;Директива - тип Асемблера 
MODEL small				;Директива - тим моделі пам'яті
STACK 256				;Директива - розмір стеку

						;Початок сегменту даних
DATASEG
exCode db 0
message db "Tymoshenko", 10, 13, '$'		;Рядки символів для виводу на екран
message2 db "Oleksii", 10, 13, '$'

						;Початок сегменту коду
CODESEG
Start:

;-------------------------------Ініціалізація DS і ES-------------------------------
	mov ax,@data		;@data ідентифікатор, що створюється директивою model
	mov ds, ax			;Завантаження початку сегменту даних в регістр ds
	mov es, ax			;Завантаження початку сегменту даних в регістр es
;-------------------------------Операції виводу на консоль-------------------------------
	mov dx, offset message					;Пересилання адреси рядка даних в регістр dx 
	mov ah, 09h								;Завантаження числа 09h до регістру ah   (Функція DOS 9h - команда виводу рядка на консоль)
	int 21h									;Виклик функції DOS 9h

	mov dx, offset message2
	mov ah, 09h
	int 21h

;-------------------------------Операція зупинки програми й очікування натискання клавіші-------------------------------
	mov ah, 01h								;Завантаження числа 1_ до регістру ah    (функція DOS 1h - команда очікування натискання клавіші)
	int 21h									;Виклик функції DOS 1h
	
;-------------------------------Вихід з програми-------------------------------
	mov ah, 4ch								;Завантаження числа 4__ до регістру ah   (функція DOS 4ch - команда виходу з програми)
	mov al,[exCode]							;Отримання коду виходу
	int 21h									;Виклик функції DOS 4ch
	end Start
